#### Group Aggregation

![group aggregation](./pics/group%20aggregation.png)

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                  'key2': ['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

df

      data1     data2 key1 key2
0 -0.053049  0.185549    a  one
1  1.771671 -0.920370    a  two
2 -0.417862  0.496777    b  one
3 -0.731587  0.932301    b  two
4 -0.119606  0.087466    a  one

- A list or array of values that is the same length as the axis being grouped

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.533005
b   -0.574724
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [6]:
means

key1  key2
a     one    -0.086328
      two     1.771671
b     one    -0.417862
      two    -0.731587
Name: data1, dtype: float64

In [7]:
means['a']

key2
one   -0.086328
two    1.771671
Name: data1, dtype: float64

In [8]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [9]:
df['data1'].groupby([states, years]).mean()

California  2005    1.771671
            2006   -0.417862
Ohio        2005   -0.392318
            2006   -0.119606
Name: data1, dtype: float64

- A value indicating a column name in a DataFrame

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.533005 -0.215785
b    -0.574724  0.714539

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.086328  0.136507
     two   1.771671 -0.920370
b    one  -0.417862  0.496777
     two  -0.731587  0.932301

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

#### Any missing values in a group key will be excluded from the result

In [13]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.053049  0.185549    a  one
1  1.771671 -0.920370    a  two
4 -0.119606  0.087466    a  one
b
      data1     data2 key1 key2
2 -0.417862  0.496777    b  one
3 -0.731587  0.932301    b  two

#### Iterating Over Groups

In [14]:
for k, group in df.groupby(['key1', 'key2']):
    print(k)
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -0.053049  0.185549    a  one
4 -0.119606  0.087466    a  one
('a', 'two')
      data1    data2 key1 key2
1  1.771671 -0.92037    a  two
('b', 'one')
      data1     data2 key1 key2
2 -0.417862  0.496777    b  one
('b', 'two')
      data1     data2 key1 key2
3 -0.731587  0.932301    b  two

In [15]:
list(df.groupby('key1'))

[('a',       data1     data2 key1 key2
  0 -0.053049  0.185549    a  one
  1  1.771671 -0.920370    a  two
  4 -0.119606  0.087466    a  one), ('b',       data1     data2 key1 key2
  2 -0.417862  0.496777    b  one
  3 -0.731587  0.932301    b  two)]

In [16]:
pieces = dict(list(df.groupby('key1')))

In [17]:
pieces

{'a':       data1     data2 key1 key2
 0 -0.053049  0.185549    a  one
 1  1.771671 -0.920370    a  two
 4 -0.119606  0.087466    a  one, 'b':       data1     data2 key1 key2
 2 -0.417862  0.496777    b  one
 3 -0.731587  0.932301    b  two}

In [18]:
pieces['b']

      data1     data2 key1 key2
2 -0.417862  0.496777    b  one
3 -0.731587  0.932301    b  two

In [19]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [20]:
grouped = df.groupby(df.dtypes, axis=1)

for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.053049  0.185549
1  1.771671 -0.920370
2 -0.417862  0.496777
3 -0.731587  0.932301
4 -0.119606  0.087466
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

#### Selecting a Column or Subset of Columns
```
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]
```
syntactic sugar for:
```
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])
```

In [21]:
df.groupby('key1')['data1']

In [22]:
df.groupby('key1')[['data2']]

In [23]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.136507
     two  -0.920370
b    one   0.496777
     two   0.932301

- A dict or Series giving a correspondence between the values on the axis being
grouped and the group names

In [24]:
people = pd.DataFrame(np.random.randn(5, 5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe     0.833495  0.578022  0.752983  0.886862  2.088334
Steve   0.471931  0.044005  0.291946 -1.464935  0.471882
Wes    -0.391243       NaN       NaN  1.475739  1.570764
Jim    -1.763018  1.008691 -0.753012 -0.372389  0.493307
Travis  0.422263 -0.142549  2.076869  2.150065 -0.523678

In [25]:
mapping = {'a':'red', 'b': 'red', 'c': 'blue',
          'd': 'blue', 'e': 'red', 'f': 'orange'}

In [26]:
by_column = people.groupby(mapping, axis=1)
by_column.size()

blue    2
red     3
dtype: int64

In [27]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [28]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

- A function to be invoked on the axis index or the individual labels in the index

In [29]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.320766  1.586713 -0.000030  1.990212  4.152405
5  0.471931  0.044005  0.291946 -1.464935  0.471882
6  0.422263 -0.142549  2.076869  2.150065 -0.523678

In [30]:
key_list = ['one', 'one', 'one', 'two', 'two']

people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.391243  0.578022  0.752983  0.886862  1.570764
  two -1.763018  1.008691 -0.753012 -0.372389  0.493307
5 one  0.471931  0.044005  0.291946 -1.464935  0.471882
6 two  0.422263 -0.142549  2.076869  2.150065 -0.523678

In [31]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                   names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [32]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.806566 -0.330997 -0.814769 -0.440688 -0.669299
1     -1.510369  0.744782  1.051777 -1.081139 -0.620891
2     -2.652270  0.208339 -0.945219  1.225692 -1.627316
3     -0.345915  0.569857  1.625195  2.443399 -0.210402

In [33]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3